blog/content/post/ai-nlp-foundations-to-advanced.org
+++
title = "05 - AI Engineering from scratch: do token ao diálogo, fundamentos e fronteira"
description = "Como texto vira número, número vira significado, e significado vira conversa"
date = 2026-05-27T10:00:00-03:00
tags = ["AI", "nlp", "transformers", "embeddings", "rag", "tokenization", "python"]
draft = true
weight = 1
author = "Vitor Lobo Ramos"
+++


Texto é a forma mais natural de comunicação humana. E a mais difícil de processar computacionalmente. Uma imagem de 224x224 tem 150 mil números. Uma frase de 10 palavras pode ter 10 milhões de interpretações diferentes, dependendo de contexto, entonação, ironia, referências implícitas e conhecimento de mundo.

Processamento de Linguagem Natural (NLP) é o campo que constrói a ponte entre texto bruto e significado computável. Este artigo percorre 29 tópicos, dos fundamentos (tokenização, TF-IDF) até a fronteira de 2026 (RAG com chunking estratégico, avaliação de LLMs, tracking de diálogo). A stack é Python para experimentação e Go para APIs de produção.

* Como texto vira número

Antes de qualquer modelo, o texto precisa virar algo que um computador entenda: números. Esse pipeline de pré-processamento parece burocrático, mas cada decisão nele ecoa até a acurácia final.

** Tokenização, stemming e lematização

Tokenização é quebrar o texto em pedaços. Parece trivial ("é só split no espaço"), mas não é: "don't" são dois tokens ou um? "New York" é uma entidade ou duas palavras? O ponto final é fim de frase ou abreviação? Um tokenizador de regex cobre 80% dos casos; os 20% restantes são o que separa um pipeline que funciona de um que produz lixo silenciosamente.

Stemming corta sufixos com regras: "running", "runs", "ran" vira "run" (ou quase). É rápido, agressivo e frequentemente erra ("university" vira "univers"). Lematização usa conhecimento gramatical: "ran" vira "run", "better" vira "good". É mais lento, mais preciso. A regra de produção: stemming pra busca (recall importa mais que precisão), lematização pra classificação (precisão importa).

O erro mais comum: pré-processar durante o treino com uma biblioteca e durante a inferência com outra. A versão do spaCy mudou? O tokenizador produz tokens diferentes? A acurácia cai e ninguém sabe por quê. Sempre serialize o pipeline de pré-processamento junto com o modelo.

** Bag of Words e TF-IDF

Bag of Words (BoW) é a representação mais simples: conte quantas vezes cada palavra aparece e jogue num vetor. "O gato comeu o rato" e "O rato comeu o gato" produzem o mesmo vetor, porque ordem não importa. Isso é uma limitação e uma feature: pra classificação de tópico, as palavras "gato" e "rato" são o sinal; a ordem é ruído.

TF-IDF refina o BoW. O TF (Term Frequency) é a contagem normalizada. O IDF (Inverse Document Frequency) penaliza palavras comuns: "o", "de", "que" aparecem em todo documento, então ganham peso zero. Palavras raras e discriminativas ("gato", "rato") ganham peso alto. O resultado é um vetor esparso onde cada dimensão é uma palavra e o valor é sua importância relativa.

#+BEGIN_SRC python
import numpy as np
from collections import Counter

def compute_tfidf(documents):
    vocab = sorted(set(w for doc in documents for w in doc.lower().split()))
    N = len(documents)
    df = Counter(w for doc in documents for w in set(doc.lower().split()))
    vectors = np.zeros((N, len(vocab)))
    for i, doc in enumerate(documents):
        words = doc.lower().split()
        tf = Counter(words)
        for j, word in enumerate(vocab):
            tf_idf = (tf[word] / len(words)) * np.log((N + 1) / (df[word] + 1))
            vectors[i, j] = tf_idf
    return vectors
#+END_SRC

Em 2026, TF-IDF + regressão logística ainda ganha de embeddings densos em tarefas de classificação estreita (spam, tópico) onde presença de palavras importa mais que semântica profunda. E os coeficientes são interpretáveis: você sabe exatamente qual palavra empurrou a classificação.

** Word2Vec: o significado como geometria

A hipótese distribucional: palavras que aparecem em contextos similares têm significados similares. "Cachorro" e "cão" aparecem perto de "latir", "passear", "ração". "Gato" também, mas menos. O Word2Vec (skip-gram com negative sampling) explora isso: treine uma rede rasa pra prever palavras de contexto a partir de uma palavra central, depois descarte a saída e fique com os pesos escondidos como embedding.

O resultado é um espaço vetorial onde operações aritméticas fazem sentido semântico: ~rei - homem + mulher ≈ rainha~. "Paris - França + Itália ≈ Roma". Cada dimensão codifica uma propriedade latente (gênero, realeza, geografia) que emergiu dos dados, sem supervisão.

A limitação: embeddings estáticos. "Banco" tem um único vetor, seja banco de sentar, banco financeiro ou banco de dados. Isso motiva embeddings contextuais (BERT, GPT), onde cada ocorrência de uma palavra ganha um vetor diferente dependendo da frase.

