ai-nlp-foundations-to-advanced/index.html
<!DOCTYPE html>
<html lang="pt-br">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <link rel="icon" href="data:,">
  <title>05 - AI Engineering from scratch: do token ao diálogo, fundamentos e fronteira — lobovit</title>
  <link rel="stylesheet" href="/css/main.css?v=3">
  <link rel="stylesheet" href="/vendor/fonts/fonts.css">
  <link rel="stylesheet" href="/vendor/prism/prism-mocha.min.css">
</head>
<body>
  <div class="frame">
    <header>
      <nav>
        <a class="site-title" href="https://lobovit.github.io/">lobovit</a>
        <span class="nav-links">
          <a href="/page/about/">about</a>
          <a href="/page/contact/">contact</a>
        </span>
      </nav>
      <hr>
    </header>
    <main>
      
<article>
  <header>
    <h1>05 - AI Engineering from scratch: do token ao diálogo, fundamentos e fronteira</h1>
    <p class="meta"><time>2026-05-27</time> · <span class="tag">AI</span><span class="tag">nlp</span><span class="tag">transformers</span><span class="tag">embeddings</span><span class="tag">rag</span><span class="tag">tokenization</span><span class="tag">python</span></p>
  </header>
  <div class="content">
    
<p>
Texto é a forma mais natural de comunicação humana. E a mais difícil de processar computacionalmente. Uma imagem de 224x224 tem 150 mil números. Uma frase de 10 palavras pode ter 10 milhões de interpretações diferentes, dependendo de contexto, entonação, ironia, referências implícitas e conhecimento de mundo.</p>
<p>
Processamento de Linguagem Natural (NLP) é o campo que constrói a ponte entre texto bruto e significado computável. Este artigo percorre 29 tópicos, dos fundamentos (tokenização, TF-IDF) até a fronteira de 2026 (RAG com chunking estratégico, avaliação de LLMs, tracking de diálogo). A stack é Python para experimentação e Go para APIs de produção.</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Como texto vira número
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
Antes de qualquer modelo, o texto precisa virar algo que um computador entenda: números. Esse pipeline de pré-processamento parece burocrático, mas cada decisão nele ecoa até a acurácia final.</p>
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Tokenização, stemming e lematização
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>
Tokenização é quebrar o texto em pedaços. Parece trivial (&#34;é só split no espaço&#34;), mas não é: &#34;don&#39;t&#34; são dois tokens ou um? &#34;New York&#34; é uma entidade ou duas palavras? O ponto final é fim de frase ou abreviação? Um tokenizador de regex cobre 80% dos casos; os 20% restantes são o que separa um pipeline que funciona de um que produz lixo silenciosamente.</p>
<p>
Stemming corta sufixos com regras: &#34;running&#34;, &#34;runs&#34;, &#34;ran&#34; vira &#34;run&#34; (ou quase). É rápido, agressivo e frequentemente erra (&#34;university&#34; vira &#34;univers&#34;). Lematização usa conhecimento gramatical: &#34;ran&#34; vira &#34;run&#34;, &#34;better&#34; vira &#34;good&#34;. É mais lento, mais preciso. A regra de produção: stemming pra busca (recall importa mais que precisão), lematização pra classificação (precisão importa).</p>
<p>
O erro mais comum: pré-processar durante o treino com uma biblioteca e durante a inferência com outra. A versão do spaCy mudou? O tokenizador produz tokens diferentes? A acurácia cai e ninguém sabe por quê. Sempre serialize o pipeline de pré-processamento junto com o modelo.</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
Bag of Words e TF-IDF
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<p>
Bag of Words (BoW) é a representação mais simples: conte quantas vezes cada palavra aparece e jogue num vetor. &#34;O gato comeu o rato&#34; e &#34;O rato comeu o gato&#34; produzem o mesmo vetor, porque ordem não importa. Isso é uma limitação e uma feature: pra classificação de tópico, as palavras &#34;gato&#34; e &#34;rato&#34; são o sinal; a ordem é ruído.</p>
<p>
TF-IDF refina o BoW. O TF (Term Frequency) é a contagem normalizada. O IDF (Inverse Document Frequency) penaliza palavras comuns: &#34;o&#34;, &#34;de&#34;, &#34;que&#34; aparecem em todo documento, então ganham peso zero. Palavras raras e discriminativas (&#34;gato&#34;, &#34;rato&#34;) ganham peso alto. O resultado é um vetor esparso onde cada dimensão é uma palavra e o valor é sua importância relativa.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl"><span class="kn">from</span> <span class="nn">collections</span> <span class="kn">import</span> <span class="n">Counter</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">compute_tfidf</span><span class="p">(</span><span class="n">documents</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">vocab</span> <span class="o">=</span> <span class="nb">sorted</span><span class="p">(</span><span class="nb">set</span><span class="p">(</span><span class="n">w</span> <span class="k">for</span> <span class="n">doc</span> <span class="ow">in</span> <span class="n">documents</span> <span class="k">for</span> <span class="n">w</span> <span class="ow">in</span> <span class="n">doc</span><span class="o">.</span><span class="n">lower</span><span class="p">()</span><span class="o">.</span><span class="n">split</span><span class="p">()))</span>
</span></span><span class="line"><span class="cl">    <span class="n">N</span> <span class="o">=</span> <span class="nb">len</span><span class="p">(</span><span class="n">documents</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="n">df</span> <span class="o">=</span> <span class="n">Counter</span><span class="p">(</span><span class="n">w</span> <span class="k">for</span> <span class="n">doc</span> <span class="ow">in</span> <span class="n">documents</span> <span class="k">for</span> <span class="n">w</span> <span class="ow">in</span> <span class="nb">set</span><span class="p">(</span><span class="n">doc</span><span class="o">.</span><span class="n">lower</span><span class="p">()</span><span class="o">.</span><span class="n">split</span><span class="p">()))</span>
</span></span><span class="line"><span class="cl">    <span class="n">vectors</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">zeros</span><span class="p">((</span><span class="n">N</span><span class="p">,</span> <span class="nb">len</span><span class="p">(</span><span class="n">vocab</span><span class="p">)))</span>
</span></span><span class="line"><span class="cl">    <span class="k">for</span> <span class="n">i</span><span class="p">,</span> <span class="n">doc</span> <span class="ow">in</span> <span class="nb">enumerate</span><span class="p">(</span><span class="n">documents</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">        <span class="n">words</span> <span class="o">=</span> <span class="n">doc</span><span class="o">.</span><span class="n">lower</span><span class="p">()</span><span class="o">.</span><span class="n">split</span><span class="p">()</span>
</span></span><span class="line"><span class="cl">        <span class="n">tf</span> <span class="o">=</span> <span class="n">Counter</span><span class="p">(</span><span class="n">words</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="k">for</span> <span class="n">j</span><span class="p">,</span> <span class="n">word</span> <span class="ow">in</span> <span class="nb">enumerate</span><span class="p">(</span><span class="n">vocab</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">            <span class="n">tf_idf</span> <span class="o">=</span> <span class="p">(</span><span class="n">tf</span><span class="p">[</span><span class="n">word</span><span class="p">]</span> <span class="o">/</span> <span class="nb">len</span><span class="p">(</span><span class="n">words</span><span class="p">))</span> <span class="o">*</span> <span class="n">np</span><span class="o">.</span><span class="n">log</span><span class="p">((</span><span class="n">N</span> <span class="o">+</span> <span class="mi">1</span><span class="p">)</span> <span class="o">/</span> <span class="p">(</span><span class="n">df</span><span class="p">[</span><span class="n">word</span><span class="p">]</span> <span class="o">+</span> <span class="mi">1</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">            <span class="n">vectors</span><span class="p">[</span><span class="n">i</span><span class="p">,</span> <span class="n">j</span><span class="p">]</span> <span class="o">=</span> <span class="n">tf_idf</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">vectors</span></span></span></code></pre></div>
</div>
<p>
Em 2026, TF-IDF + regressão logística ainda ganha de embeddings densos em tarefas de classificação estreita (spam, tópico) onde presença de palavras importa mais que semântica profunda. E os coeficientes são interpretáveis: você sabe exatamente qual palavra empurrou a classificação.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Word2Vec: o significado como geometria
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>
A hipótese distribucional: palavras que aparecem em contextos similares têm significados similares. &#34;Cachorro&#34; e &#34;cão&#34; aparecem perto de &#34;latir&#34;, &#34;passear&#34;, &#34;ração&#34;. &#34;Gato&#34; também, mas menos. O Word2Vec (skip-gram com negative sampling) explora isso: treine uma rede rasa pra prever palavras de contexto a partir de uma palavra central, depois descarte a saída e fique com os pesos escondidos como embedding.</p>
<p>
O resultado é um espaço vetorial onde operações aritméticas fazem sentido semântico: <code>rei - homem + mulher ≈ rainha</code>. &#34;Paris - França + Itália ≈ Roma&#34;. Cada dimensão codifica uma propriedade latente (gênero, realeza, geografia) que emergiu dos dados, sem supervisão.</p>
<p>
A limitação: embeddings estáticos. &#34;Banco&#34; tem um único vetor, seja banco de sentar, banco financeiro ou banco de dados. Isso motiva embeddings contextuais (BERT, GPT), onde cada ocorrência de uma palavra ganha um vetor diferente dependendo da frase.</p>
</div>
</div>
