ai-nlp-foundations-to-advanced/index.html
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
GloVe, FastText e subword embeddings
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>
GloVe fatoriza a matriz de co-ocorrência palavra-palavra com uma loss de mínimos quadrados ponderada. O insight: a razão de co-ocorrências carrega mais informação que as probabilidades brutas. Se &#34;gelo&#34; co-ocorre muito com &#34;sólido&#34; e pouco com &#34;gás&#34;, e &#34;vapor&#34; é o oposto, a razão P(sólido|gelo)/P(sólido|vapor) é enorme e captura a distinção semântica.</p>
<p>
FastText representa cada palavra como a soma dos embeddings de seus character n-gramas. &#34;gato&#34; = &#34;ga&#34; + &#34;at&#34; + &#34;to&#34; + &#34;&lt;gat&#34; + &#34;ato&gt;&#34;. Isso resolve o problema de palavras fora do vocabulário (OOV): mesmo &#34;gatinho&#34;, nunca vista, tem n-gramas que o modelo conhece. E captura morfologia: &#34;gato&#34;, &#34;gata&#34;, &#34;gatos&#34;, &#34;gatinho&#34; compartilham n-gramas e ficam próximos no espaço.</p>
<p>
BPE (Byte-Pair Encoding) é o esquema por trás de todo tokenizador de LLM moderno. Comece com caracteres individuais como vocabulário. Iterativamente, encontre o par adjacente mais frequente no corpus e funda num novo token. Repita até atingir o tamanho de vocabulário desejado (50k tokens é típico). O resultado é um vocabulário de subpalavras que garante zero tokens desconhecidos: qualquer palavra é decomponível em subpalavras conhecidas.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
Tarefas clássicas de NLP
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>
Antes dos transformers resolverem tudo com uma arquitetura só, cada tarefa de NLP tinha sua própria arquitetura especializada. Entender essas tarefas é entender o que os LLMs estão fazendo por baixo quando você pede &#34;classifique esse texto&#34;.</p>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Análise de sentimento
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>
A tarefa mais comum e mais enganosamente difícil do NLP. &#34;O filme foi incrível&#34; é positivo. &#34;O filme não foi nada incrível&#34; também é positivo? Não, a negação inverteu. &#34;O filme foi incrível… de tão ruim&#34; é sarcasmo. &#34;O filme foi incrível para os padrões do diretor&#34; é uma facada disfarçada de elogio.</p>
<p>
Naive Bayes multinomial com suavização de Laplace é o baseline que nunca morre: rápido, interpretável, funciona com poucos dados. Regressão logística com L2 adiciona calibração de probabilidade. Um truque simples que adiciona 1-2% de acurácia: prefixe tokens após palavras de negação com <code>NOT_</code> (&#34;não gostei&#34; vira &#34;não NOT_gostei&#34;), ensinando o modelo que a polaridade inverteu. Avalie com macro-F1, não com acurácia bruta: classes desbalanceadas são a regra, não a exceção.</p>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
NER: extraindo entidades do texto
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>
Named Entity Recognition (NER) identifica pessoas, organizações, locais, datas e valores no texto. &#34;Maria comprou um iPhone na loja da Apple em São Paulo em janeiro&#34; tem quatro entidades: Maria (pessoa), iPhone (produto), Apple (organização), São Paulo (local), janeiro (data).</p>
<p>
A abordagem clássica é BIO tagging: cada token recebe um rótulo B (begin), I (inside) ou O (outside). &#34;Maria&#34; = B-PER, &#34;Apple&#34; = B-ORG. Isso transforma NER num problema de classificação sequencial, onde o contexto importa: &#34;Apple&#34; depois de &#34;comprei um&#34; é produto; depois de &#34;trabalho na&#34; é organização.</p>
<p>
O baseline de 2026: teste zero-shot com um LLM antes de anotar dados. Se o GPT-4o acerta 80% das entidades, você precisa de muito dado anotado pra bater isso. Pra baixa latência ou compliance, CRF (Conditional Random Fields) com features manuais ainda é deployado em produção. E sempre avalie com entity-level F1, nunca token-level: acertar 90% dos tokens O (fácil) infla a métrica artificialmente.</p>
</div>
</div>
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
POS tagging e parsing sintático
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<p>
Part-of-Speech tagging atribui categorias gramaticais a cada token: substantivo, verbo, adjetivo, preposição. Dependency parsing constrói uma árvore de dependências: cada palavra tem um &#34;pai&#34; sintático e um tipo de relação gramatical (sujeito, objeto, modificador).</p>
<p>
Em 2026, POS e parsing raramente são o produto final. Mas são infraestrutura invisível: lematização precisa de POS, validação de extração estruturada usa dependências, decomposição de queries usa árvores sintáticas, transferência cross-lingual usa anotações universais. O baseline de ~85% de acurácia é um tagger que sempre chuta a classe mais frequente da palavra. Um HMM bigrama com Viterbi sobe pra ~93%. O resto é engenharia de features.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-10" class="outline-2">
<h2 id="headline-10">
A era pré-transformer
</h2>
<div id="outline-text-headline-10" class="outline-text-2">
<p>
Antes de &#34;Attention is All You Need&#34;, NLP era uma colcha de retalhos de arquiteturas especializadas. Cada uma delas deixou uma lição que sobreviveu à era transformer.</p>
<div id="outline-container-headline-11" class="outline-3">
<h3 id="headline-11">
CNNs e RNNs para texto
</h3>
<div id="outline-text-headline-11" class="outline-text-3">
<p>
TextCNN aplica convoluções 1D sobre sequências de embeddings: kernels de tamanho 2, 3, 4, 5 funcionam como detectores de n-gramas aprendidos. Max-pooling global sobre o tempo extrai o feature mais forte de cada kernel. O resultado é um classificador paralelo, rápido e leve que ainda é a escolha certa pra on-device e edge.</p>
<p>
RNNs (LSTM, GRU) processam tokens sequencialmente com estado oculto que persiste no tempo. A LSTM resolve o vanishing gradient com um &#34;cell state&#34; que funciona como uma highway de informação: gates de forget, input e output controlam o que é lembrado, adicionado e exposto. A GRU simplifica com dois gates (reset e update) e performance similar com menos parâmetros.</p>
<p>
O legado: BiLSTM-CRF ainda é o estado da arte pra sequence labeling com poucos dados. E LSTMs são a arquitetura certa pra streaming (você não pode esperar a frase inteira chegar pra processar).</p>
<blockquote>
<p><em>Em miúdos:</em> <code>Vanishing gradient</code> em RNNs é quando o sinal de erro que chega no início da sequência é tão atenuado que a rede não aprende dependências de longo prazo. A LSTM resolve com o cell state: um caminho linear onde o gradiente flui sem multiplicações repetidas. <code>Teacher forcing</code> é dar a resposta correta como input do próximo passo durante o treino, em vez de usar a predição do modelo. Acelera a convergência, mas cria um gap entre treino e inferência (o modelo nunca pratica recuperação de erros).</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-12" class="outline-3">
<h3 id="headline-12">
Seq2Seq e o nascimento da atenção
</h3>
<div id="outline-text-headline-12" class="outline-text-3">
<p>
O modelo sequence-to-sequence (seq2seq) conecta duas RNNs: um encoder lê a entrada e produz um vetor de contexto fixo; um decoder gera a saída token a token a partir desse vetor. Funciona pra tradução, sumarização, diálogo.</p>
<p>
O gargalo: tudo que o encoder sabe sobre a frase inteira precisa caber num único vetor de contexto. Se a frase tem 100 tokens, as primeiras palavras já foram &#34;esquecidas&#34; quando o decoder começa. Numa tarefa de cópia (reproduzir a entrada na saída), a acurácia colapsa com o comprimento da sequência.</p>
<p>
A atenção resolve isso. Em vez de um vetor fixo, o decoder olha pra todos os estados do encoder e calcula uma média ponderada por relevância a cada passo. É como se o decoder perguntasse &#34;quais palavras da entrada são relevantes pra esse token que vou gerar agora?&#34;. A atenção é alinhamento explícito e aprendido.</p>
<p>
O mapeamento pra terminologia transformer: query = estado do decoder (o que estou procurando?), key = estados do encoder (o que está disponível?), value = estados do encoder (o que vou extrair?). Self-attention é o caso especial onde query, key e value vêm da mesma sequência, cada uma com projeções diferentes.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-13" class="outline-2">
<h2 id="headline-13">
Aplicações clássicas de NLP
</h2>
