ai-nlp-foundations-to-advanced/index.html
<div id="outline-text-headline-13" class="outline-text-2">
<div id="outline-container-headline-14" class="outline-3">
<h3 id="headline-14">
Tradução automática
</h3>
<div id="outline-text-headline-14" class="outline-text-3">
<p>
O pipeline de produção em 2026: modelo encoder-decoder multilíngue pré-treinado (NLLB-200, suporta 200 línguas), tokenização subword com language tags, decodificação por beam search (mantenha os k melhores caminhos em paralelo). Avaliação em três níveis: sacreBLEU + chrF (heurísticas rápidas), COMET (modelo neural treinado em julgamentos humanos), e LLM-as-judge (qualidade subjetiva).</p>
<p>
Cinco modos de falha: alucinação (inventa conteúdo ausente na fonte), off-target (gera na língua errada), desvio de terminologia (traduz termo técnico como leigo), mismatch de formalidade (trata cliente como amigo), explosão de comprimento (gera 3x mais tokens que a entrada). Fine-tuning com poucos milhares de pares de alta qualidade bate centenas de milhares de pares ruidosos.</p>
</div>
</div>
<div id="outline-container-headline-15" class="outline-3">
<h3 id="headline-15">
Sumarização
</h3>
<div id="outline-text-headline-15" class="outline-text-3">
<p>
Dois problemas diferentes sob o mesmo nome. Sumarização extrativa seleciona e ordena frases existentes do texto. TextRank aplica PageRank sobre um grafo de similaridade entre frases: frases centrais (similares a muitas outras) viram o sumário. É seguro (nunca alucina), mas não consegue fundir informação distribuída em várias frases.</p>
<p>
Sumarização abstrativa gera texto novo com um transformer (BART, Pegasus). É fluente e compressiva, mas propensa a alucinação: troca entidades (&#34;João&#34; vira &#34;Maria&#34;), desvia números (&#34;30%&#34; vira &#34;50%&#34;), inventa fatos. A regra de produção: extrativa pra conteúdo com implicações legais ou de compliance; abstrativa só com um gate de factualidade que verifica claims contra a fonte.</p>
</div>
</div>
<div id="outline-container-headline-16" class="outline-3">
<h3 id="headline-16">
Question Answering
</h3>
<div id="outline-text-headline-16" class="outline-text-3">
<p>
Três arquiteturas. Extractive QA encontra um span de resposta dentro de um texto dado: &#34;O texto diz que X, a resposta começa no token 42 e termina no 45&#34;. Open-domain QA adiciona retrieval: primeiro busque passagens relevantes, depois extraia a resposta. Generative QA (closed-book) responde diretamente da memória paramétrica do modelo, sem documentos externos.</p>
<p>
RAG (Retrieval-Augmented Generation) é o padrão de 2026: retrieval + geração num loop. O RAGAS avalia com quatro métricas sem necessidade de ground truth: faithfulness (a resposta é suportada pelo contexto?), answer relevance (a resposta é pertinente à pergunta?), context precision (o contexto relevante está no topo?), context recall (todo o contexto necessário foi recuperado?).</p>
</div>
</div>
<div id="outline-container-headline-17" class="outline-3">
<h3 id="headline-17">
Busca e recuperação de informação
</h3>
<div id="outline-text-headline-17" class="outline-text-3">
<p>
A stack de retrieval tem quatro camadas. Sparse (BM25) para matching exato de termos: rápido, interpretável, bom pra queries curtas. Dense (bi-encoder) para similaridade semântica: embedding da query vs embeddings dos documentos, similaridade de cosseno. RRF (Reciprocal Rank Fusion) combina rankings sem precisar calibrar scores. Cross-encoder reranking refaz o top-30 com um modelo que processa query e documento juntos.</p>
<p>
As lições de 2026: 80% das falhas de RAG vêm do chunking, não do modelo. O padrão parent-document (indexe chunks pequenos, retorne o documento pai inteiro) consistentemente melhora qualidade. Versionar tudo: prompts, estratégia de chunking, modelo de embedding, reranker. Com RRF, k=60 é um bom ponto de partida. Rerank com cross-encoder nos top-30.</p>
</div>
</div>
<div id="outline-container-headline-18" class="outline-3">
<h3 id="headline-18">
Modelagem de tópicos
</h3>
<div id="outline-text-headline-18" class="outline-text-3">
<p>
Duas famílias. LDA (2003) modela cada documento como mistura de tópicos latentes e cada tópico como distribuição sobre palavras. É Bayesiano, produz tópicos interpretáveis (cada tópico é uma lista de palavras com probabilidades) e permite pertencimento parcial (um documento é 60% esporte, 40% política). BERTopic (2020) codifica documentos com transformer, reduz com UMAP, clusteriza com HDBSCAN e extrai palavras representativas com c-TF-IDF.</p>
<p>
Regra prática: LDA pra documentos longos com mistura de tópicos; BERTopic pra textos curtos e agrupamento semântico. Avalie com coerência c_v (quão semanticamente coeso é cada tópico) e diversidade de tópicos (quão diferentes eles são entre si).</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-19" class="outline-2">
<h2 id="headline-19">
Infraestrutura moderna de NLP
</h2>
<div id="outline-text-headline-19" class="outline-text-2">
<p>
Os blocos de construção que todo pipeline de NLP moderno usa, independentemente da tarefa final.</p>
<div id="outline-container-headline-20" class="outline-3">
<h3 id="headline-20">
Modelagem de língua antes dos transformers
</h3>
<div id="outline-text-headline-20" class="outline-text-3">
<p>
Modelos de n-gramas estimam <code>P(palavra | contexto)</code> contando ocorrências de sequências e suavizando os zeros. A suavização de Kneser-Ney é o insight profundo: use probabilidade de continuação (em quantos contextos diferentes uma palavra aparece?) em vez de frequência bruta. &#34;Francisco&#34; aparece muito, mas quase sempre depois de &#34;São&#34;; tem baixa probabilidade de continuação. &#34;Cachorro&#34; aparece em muitos contextos diferentes; tem alta probabilidade de continuação.</p>
<p>
Perplexidade é a métrica: <code>exp(-média log P(palavra | contexto))</code>. Um modelo de 4-gramas com Kneser-Ney atinge ~140 de perplexidade. Transformers modernos atingem 15-30. A perplexidade mede quão &#34;surpreso&#34; o modelo fica com o texto real: quanto menor, melhor.</p>
</div>
</div>
<div id="outline-container-headline-21" class="outline-3">
<h3 id="headline-21">
Multilinguismo e a taxação do tokenizador
</h3>
<div id="outline-text-headline-21" class="outline-text-3">
<p>
Modelos multilíngues (XLM-R, NLLB-200) funcionam por transferência cross-lingual: um espaço de embedding compartilhado emerge durante o pré-treinamento multilingual, e frases semanticamente similares em línguas diferentes naturalmente se agrupam. Fine-tune o modelo em inglês, e a classificação zero-shot funciona em 100+ línguas.</p>
<p>
A escolha da língua fonte importa. Uma língua tipologicamente próxima e de altos recursos frequentemente supera o inglês como fonte de fine-tuning. E existe o &#34;tokenization tax&#34;: línguas de baixos recursos podem precisar de 3-5x mais tokens por palavra que o inglês porque o BPE foi treinado majoritariamente em dados latinos. Isso silenciosamente consome contexto, eficiência de treino e acurácia.</p>
</div>
</div>
<div id="outline-container-headline-22" class="outline-3">
<h3 id="headline-22">
Tokenização subword: BPE, Unigram e SentencePiece
</h3>
<div id="outline-text-headline-22" class="outline-text-3">
<p>
Três algoritmos, um propósito: quebrar texto em subpalavras pra garantir cobertura total de vocabulário com tamanho fixo. BPE (GPT, LLaMA) funde iterativamente os pares adjacentes mais frequentes. Unigram (T5, Gemma) começa com um vocabulário grande e vai podando probabilisticamente os tokens menos úteis. WordPiece (BERT) usa máxima verossimilhança em vez de frequência bruta pra decidir os merges.</p>
<p>
As bibliotecas: tiktoken (encoding rápido, sem treino), SentencePiece (treina BPE ou Unigram em texto puro, sem necessidade de pré-tokenização), HF Tokenizers (ambos, com API Python idiomática). As armadilhas: tokenizer drift (modelo treinado com vocabulário A, deployado com vocabulário B), ambiguidade de whitespace, e subtreinamento multilíngue que faz scripts não-latinos explodirem em contagem de tokens.</p>
</div>
</div>
