ai-nlp-foundations-to-advanced/index.html
<div id="outline-container-headline-23" class="outline-3">
<h3 id="headline-23">
Saídas estruturadas e decodificação restrita
</h3>
<div id="outline-text-headline-23" class="outline-text-3">
<p>
Três camadas pra garantir que um LLM produza JSON válido, não &#34;claro, aqui está o JSON:&#34; seguido de alucinação. Prompt engineering funciona ~80% das vezes. APIs nativas (response_format da OpenAI, tool use da Anthropic) são confiáveis mas vendor-locked. Decodificação restrita (Outlines, XGrammar) mascara tokens inválidos a cada passo da geração: o modelo fisicamente não pode emitir tokens que quebram o schema. É 100% garantido e frequentemente mais rápido que geração livre, porque o espaço de busca é menor.</p>
<p>
A armadilha contra-intuitiva: a ordem dos campos no schema importa. Coloque raciocínio antes da resposta. Se o schema tem <code>{reasoning, answer}</code>, o modelo pensa e depois responde. Se tem <code>{answer, reasoning}</code>, o modelo se compromete com uma resposta antes de raciocinar.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-24" class="outline-2">
<h2 id="headline-24">
Compreensão profunda e conhecimento
</h2>
<div id="outline-text-headline-24" class="outline-text-2">
<p>
As camadas de NLP que transformam texto em fatos verificáveis e conhecimento estruturado.</p>
<div id="outline-container-headline-25" class="outline-3">
<h3 id="headline-25">
NLI e implicação textual
</h3>
<div id="outline-text-headline-25" class="outline-text-3">
<p>
Natural Language Inference é a tarefa de determinar se uma hipótese é consequência lógica de uma premissa: entailment (a premissa implica a hipótese), contradiction (a premissa contradiz a hipótese) ou neutral (nem implica nem contradiz). Parece acadêmico, mas é a fita adesiva do NLP moderno.</p>
<p>
Três usos em produção: detecção de alucinação (premissa = documento fonte, hipótese = afirmação gerada), QA fundamentada (premissa = passagem recuperada, hipótese = resposta gerada), e classificação zero-shot (verbalize rótulos como hipóteses, escolha o de maior entailment). NLI é o verificador semântico mais barato disponível; está sob o capô do RAGAS, DeepEval e toda métrica de faithfulness.</p>
</div>
</div>
<div id="outline-container-headline-26" class="outline-3">
<h3 id="headline-26">
Embeddings em 2026: BGE-M3, Matryoshka e o fim do one-size-fits-all
</h3>
<div id="outline-text-headline-26" class="outline-text-3">
<p>
Escolher um modelo de embedding envolve cinco eixos: denso vs esparso vs multi-vetor (ColBERT), cobertura de línguas, comprimento de contexto (anunciado vs efetivo), orçamento de dimensão (Matryoshka), e aberto vs hospedado. BGE-M3 é o padrão de 2026: um único modelo produz embeddings densos, esparsos e multi-vetor simultaneamente, combináveis por soma ponderada.</p>
<p>
Matryoshka representation learning permite truncar um vetor de 1536 dimensões pra 256 com 1% de perda de acurácia e 6x de economia de armazenamento. As armadilhas: esquecer o prefixo de query (modelos BGE precisam de &#34;Represent this sentence for searching relevant passages:&#34;), cortar dimensão demais, truncar contexto silenciosamente sem aviso.</p>
</div>
</div>
<div id="outline-container-headline-27" class="outline-3">
<h3 id="headline-27">
Chunking para RAG: a configuração que importa mais que o modelo
</h3>
<div id="outline-text-headline-27" class="outline-text-3">
<p>
Seis estratégias. Fixed (tamanho fixo, simples e previsível). Recursive (divide por parágrafos, frases, palavras até caber no limite, padrão de 2026). Semantic (divide em fronteiras de tópico usando similaridade de embeddings). Parent-document (indexe chunks pequenos pra busca, retorne o documento pai pro LLM). Late chunking (embeda o documento inteiro, depois faça pooling por chunk, preservando contexto global). Contextual retrieval (prefixe cada chunk com um resumo gerado por LLM do documento pai).</p>
<p>
Os benchmarks de 2026 surpreendem: recursive 512 bate semantic. Overlap frequentemente não traz benefício mensurável. Qualidade de resposta cai por volta de 2500 tokens de contexto acumulado. Match o tamanho do chunk ao tipo de query: 256-512 pra factoides, 512-1024 pra análise.</p>
</div>
</div>
<div id="outline-container-headline-28" class="outline-3">
<h3 id="headline-28">
Coreferência, linking e extração de relações
</h3>
<div id="outline-text-headline-28" class="outline-text-3">
<p>
Coreferência liga todas as menções à mesma entidade: &#34;Maria&#34;, &#34;ela&#34;, &#34;a diretora&#34;, &#34;a responsável&#34; são a mesma pessoa. O estado da arte (Lee et al., 2017) é span-based: enumere todos os spans possíveis, ranqueie pares (menção, antecedente) com uma rede neural, e resolva clusters. Cinco métricas existem porque nenhuma captura qualidade de clustering sozinha.</p>
<p>
Entity linking resolve &#34;Jordan&#34; pra Michael Jordan (basquete), Jordânia (país) ou Michael I. Jordan (professor de Berkeley). É um pipeline de duas etapas: geração de candidatos (índice de aliases da Wikipedia) e desambiguação (score de similaridade contextual). Modelos generativos modernos (GENRE) decodificam nomes de entidade token a token com saída restrita por trie.</p>
<p>
Extração de relações transforma texto livre em triplas (sujeito, relação, objeto). Três abordagens: padrões Hearst (&#34;X, como Y&#34; implica que Y é um tipo de X), supervised seq2seq (REBEL), e LLM-prompted com AEVS (Anchor-Extraction-Verification-Supplement) que verifica cada tripla contra spans da fonte pra evitar alucinação. O pipeline completo: NER, coref, entity linking, extração de relações, mapeamento de ontologia, carregamento no grafo.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-29" class="outline-2">
<h2 id="headline-29">
Avaliação e produção
</h2>
<div id="outline-text-headline-29" class="outline-text-2">
<p>
As camadas finais: como saber se seu sistema de NLP funciona e como mantê-lo funcionando.</p>
<div id="outline-container-headline-30" class="outline-3">
<h3 id="headline-30">
Frameworks de avaliação: RAGAS, DeepEval, G-Eval
</h3>
<div id="outline-text-headline-30" class="outline-text-3">
<p>
Três frameworks pra avaliar saídas de LLM em escala. RAGAS fornece quatro métricas reference-free para RAG. DeepEval integra com pytest pra CI/CD, suportando métricas G-Eval customizadas (LLM-as-judge com rubricas chain-of-thought). G-Eval usa um LLM juiz que avalia saídas numa escala Likert com rubrica definida pelo usuário.</p>
<p>
LLM-as-judge precisa ser calibrado contra anotadores humanos (Spearman rho &gt; 0.7). Precisa evitar viés de auto-avaliação (o mesmo modelo não pode julgar a si mesmo). E precisa reportar falhas do quantil inferior, não se esconder atrás de médias. Uma chamada de juiz custa ~$0.003; 1000 amostras de regressão saem por menos de $5.</p>
</div>
</div>
<div id="outline-container-headline-31" class="outline-3">
<h3 id="headline-31">
Avaliação de contexto longo
</h3>
<div id="outline-text-headline-31" class="outline-text-3">
<p>
Janelas de contexto anunciadas (1M, 10M tokens) raramente se traduzem em contexto utilizável. NIAH (Needle In A Haystack) planta um fato aleatório num texto enorme e pergunta sobre ele. É o baseline necessário, mas insuficiente: modelos de fronteira saturam o teste. RULER adiciona 13 tipos de tarefa (rastreamento multi-hop, agregação, recuperação multi-chave) que revelam degradação abrupta além de ~128k tokens.</p>
<p>
O comprimento efetivo de raciocínio é tipicamente 25-50% da janela anunciada. Para seus próprios dados, monte um NIAH customizado com varreduras de profundidade × comprimento, variantes multi-needle e rastreamento de variáveis. Sempre combine NIAH com pelo menos uma tarefa de raciocínio antes de confiar em claims de contexto.</p>
</div>
</div>
<div id="outline-container-headline-32" class="outline-3">
<h3 id="headline-32">
Dialogue State Tracking
</h3>
<div id="outline-text-headline-32" class="outline-text-3">
<p>
Mantém um dicionário de slots (culinária, área, preço, pessoas) ao longo de múltiplos turnos de diálogo orientado a tarefa. O usuário diz &#34;quero italiano&#34;, depois &#34;aliás, mude pra tailandês&#34;, depois &#34;pra dois&#34;. O estado precisa refletir cada correção, negação e confirmação implícita.</p>
<p>
A progressão de arquiteturas: extratores baseados em regex (baseline forte pra domínios estreitos), TripPy/BERT (cópia generativa), LDST (LLaMA + LoRA), e o padrão de 2026: LLM com schema Pydantic + decodificação restrita pra estados garantidamente válidos. Avaliado por Joint Goal Accuracy (todos os slots corretos, tudo ou nada). O tradeoff principal: regeneração com histórico completo lida naturalmente com correções mas custa O(n²) tokens; atualização incremental é mais barata mas frágil em correções.</p>
</div>
</div>
</div>
</div>
